var mapPos = {
    hangzhou: [
        [
            [3536, 3026],   //游戏坐标
            [5414, 1056]    //图片坐标
        ],
        [
            [1266, 311],    //游戏坐标
            [3010, 3933]    //图片坐标
        ]
    ],
    jiuhua: [
        [
            [3536, 3026],   //游戏坐标
            [5414, 1056]    //图片坐标
        ],
        [
            [1266, 311],    //游戏坐标
            [3010, 3933]    //图片坐标
        ]
    ]
};

// var mobaoPos = {
//     hangzhou: [
//         {
//             name: "杭州城",
//             description: "",
//             manuLevel: 1,
//             roleLevel: 12,
//             time: "白昼",
//             weather: "晴天",
//             condition: [
//                 {
//                     type: "云游揽胜",
//                     location: [
//                         {name: "商道日晷", x: 2010, y: 1010},
//                         {name: "永兴塔顶", x: 2182, y: 472},
//                         {name: "擂台铜锣", x: 1855, y: 1068},
//                         {name: "钱塘城门", x: 2010, y: 1329}
//                     ]
//                 },
//                 {
//                     type: "悠游趣闻",
//                     location: [
//                         {name: "花船木伞", x: 1954, y: 721},
//                         {name: "藏经典籍", x: 2226, y: 674},
//                         {name: "永兴遗珠", x: 2348, y: 567},
//                         {name: "商行古玩", x: 1853, y: 465}
//                     ]
//                 }
//             ]
//         },
//         {
//             name: "一醉轩",
//             description: "",
//             manuLevel: 1,
//             roleLevel: 14,
//             time: "戌时或亥时",
//             weather: "晴天",
//             condition: [
//                 {
//                     type: "悠游趣闻",
//                     location: [
//                         {name: "石桌茶点", x: 2738, y: 2070},
//                         {name: "廊道古琴", x: 2831, y: 2197},
//                         {name: "庭院睡莲", x: 2715, y: 2084},
//                         {name: "山石文玩", x: 2671, y: 2083}
//                     ]
//                 },
//                 {
//                     type: "悠游趣闻",
//                     location: [
//                         {name: "范仲淹", x: 2788, y: 2068},
//                         {name: "柳永",  x: 2757,y: 2088},
//                         {name: "梅尧臣", x: 2740, y: 2131},
//                         {name: "晏殊",  x: 2732,y: 2179}
//                     ]
//                 }
//             ]
//         }
//     ]
// };

var mobaoPos = {
    hangzhou: [{"name":"杭州城","description":"杭州城","manuLevel":0,"roleLevel":0,"time":"白昼","weather":"晴天","condition":[{"type":"悠游趣闻","location":[{"name":"永兴寺佛塔","x":"2191","y":"473"},{"name":"永兴寺佛塔","x":"1955","y":"722"},{"name":"杭州城门","x":"2009","y":"1287"},{"name":"杭州城门","x":"1853","y":"465"},{"name":"商道日晷","x":"2011","y":"1011"},{"name":"商道日晷","x":"2227","y":"671"},{"name":"擂台铜锣","x":"1855","y":"1067"},{"name":"擂台铜锣","x":"2347","y":"567"}]}]},{"name":"一醉轩","description":"一醉轩","manuLevel":0,"roleLevel":0,"time":"白昼","weather":"晴天","condition":[{"type":"悠游趣闻","location":[{"name":"柳永","x":"2757","y":"2087"},{"name":"柳永","x":"2670","y":"2083"},{"name":"范仲淹","x":"2787","y":"2067"},{"name":"范仲淹","x":"2715","y":"2082"},{"name":"梅尧臣","x":"2740","y":"2133"},{"name":"梅尧臣","x":"2738","y":"2070"},{"name":"晏殊","x":"2732","y":"2181"},{"name":"晏殊","x":"2830","y":"2197"}]}]},{"name":"三潭印月","description":"西湖","manuLevel":0,"roleLevel":0,"time":"白昼","weather":"晴天","condition":[{"type":"悠游趣闻","location":[{"name":"问水别院","x":"1272","y":"2249"},{"name":"问水别院","x":"853","y":"1946"},{"name":"游心客船","x":"1054","y":"1984"},{"name":"游心客船","x":"1174","y":"2326"},{"name":"三潭映月","x":"887","y":"1847"},{"name":"三潭映月","x":"1271","y":"2283"},{"name":"野拂渡船","x":"1107","y":"2421"},{"name":"野拂渡船","x":"1266","y":"2206"}]}]},{"name":"问道台","description":"问道台","manuLevel":0,"roleLevel":0,"time":"白昼","weather":"晴天","condition":[{"type":"悠游趣闻","location":[{"name":"山道木亭","x":"2809","y":"2895"},{"name":"山道木亭","x":"2569","y":"2978"},{"name":"临山别院","x":"2695","y":"2893"},{"name":"临山别院","x":"2804","y":"3109"},{"name":"问道石桥","x":"2769","y":"3157"},{"name":"问道石桥","x":"2784","y":"3263"},{"name":"密道入口","x":"2721","y":"3325"},{"name":"密道入口","x":"2847","y":"3164"}]}]},{"name":"天绝禅院","description":"天绝禅院","manuLevel":0,"roleLevel":0,"time":"白昼","weather":"晴天","condition":[{"type":"悠游趣闻","location":[{"name":"禅字影壁","x":"1083","y":"2919"},{"name":"禅字影壁","x":"1299","y":"2884"},{"name":"石塔之巅","x":"926","y":"3076"},{"name":"石塔之巅","x":"1331","y":"2941"},{"name":"祈福古树","x":"1222","y":"2984"},{"name":"祈福古树","x":"1226","y":"3056"},{"name":"增长金刚","x":"1104","y":"3054"},{"name":"增长金刚","x":"1065","y":"3143"}]}]},{"name":"淬剑清谷","description":"淬剑谷","manuLevel":0,"roleLevel":0,"time":"白昼","weather":"晴天","condition":[{"type":"悠游趣闻","location":[{"name":"剑谷界碑","x":"3059","y":"1823"},{"name":"剑谷界碑","x":"3202","y":"1784"},{"name":"剑池天剑","x":"3197","y":"1785"},{"name":"剑池天剑","x":"3087","y":"1737"},{"name":"环廊入口","x":"3153","y":"1681"},{"name":"环廊入口","x":"3165","y":"1681"},{"name":"清谷幽居","x":"3066","y":"1738"},{"name":"清谷幽居","x":"3265","y":"1788"}]}]},{"name":"风雨钱塘","description":"钱塘江码头","manuLevel":0,"roleLevel":0,"time":"白昼","weather":"晴天","condition":[{"type":"悠游趣闻","location":[{"name":"望江城门","x":"1692","y":"357"},{"name":"望江城门","x":"1209","y":"747"},{"name":"清波城门","x":"1510","y":"851"},{"name":"清波城门","x":"1477","y":"1056"},{"name":"望江码头","x":"1820","y":"207"},{"name":"望江码头","x":"1477","y":"1056"},{"name":"清波码头","x":"1234","y":"929"},{"name":"清波码头","x":"1252","y":"739"}]}]},{"name":"吴王陵","description":"吴王陵","manuLevel":0,"roleLevel":0,"time":"白昼","weather":"晴天","condition":[{"type":"悠游趣闻","location":[{"name":"护陵别院","x":"3192","y":"2006"},{"name":"护陵别院","x":"3442","y":"2017"},{"name":"山道廊亭","x":"3292","y":"2022"},{"name":"山道廊亭","x":"2519","y":"2011"},{"name":"后山木亭","x":"3621","y":"2074"},{"name":"后山木亭","x":"3547","y":"2002"},{"name":"正殿神台","x":"3630","y":"1991"},{"name":"正殿神台","x":"3417","y":"2208"}]}]},{"name":"百里荡","description":"百里荡","manuLevel":0,"roleLevel":0,"time":"白昼","weather":"晴天","condition":[{"type":"悠游趣闻","location":[{"name":"龙首水坝","x":"2353","y":"2682"},{"name":"龙首水坝","x":"2186","y":"2670"},{"name":"上南土地","x":"2153","y":"2698"},{"name":"上南土地","x":"2281","y":"3010"},{"name":"石甬之首","x":"2221","y":"2863"},{"name":"石甬之首","x":"2424","y":"2859"},{"name":"后山桃树","x":"2284","y":"3013"},{"name":"后山桃树","x":"2425","y":"2927"}]}]},{"name":"东平郡王府","description":"东平郡王府","manuLevel":0,"roleLevel":0,"time":"白昼","weather":"晴天","condition":[{"type":"悠游趣闻","location":[{"name":"城门点台","x":"1812","y":"3129"},{"name":"城门点台","x":"1632","y":"3152"},{"name":"东平之焰","x":"1642","y":"3550"},{"name":"东平之焰","x":"1672","y":"3525"},{"name":"金龙之脊","x":"1693","y":"3669"},{"name":"金龙之脊","x":"2001","y":"3539"},{"name":"木塔之巅","x":"1550","y":"3724"},{"name":"木塔之巅","x":"1805","y":"3136"}]}]},{"name":"雷峰夕照","description":"西湖","manuLevel":0,"roleLevel":0,"time":"白昼","weather":"晴天","condition":[{"type":"悠游趣闻","location":[]}]}]
};


function gameToMap(arr, pos){
    var gw = arr[0][0][0] - arr[1][0][0];
    var gh = arr[0][0][1] - arr[1][0][1];
    var pw = arr[0][1][0] - arr[1][1][0];
    var ph = arr[0][1][1] - arr[1][1][1];
    var x = (pos[0] - arr[0][0][0]) / gw * pw + arr[0][1][0];
    var y = (pos[1] - arr[0][0][1]) / gh * ph + arr[0][1][1];
    console.log(gw, gh, pw, ph ,x, y);

    return [x, y];
}

function mapTogame(){

}